tutorials/multiphase/interFoam/RAS/mixerVesselAMI/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.oil 1
);

regions
(
    boxToCell
    {
        box (-4 -4 -1) (4 4 0.74);
        fieldValues
        (
            volScalarFieldValue alpha.oil 0
        );
    }
);


// ************************************************************************* //
